ConnectMe/app/controllers/login_controller.rb

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` IN ('risdsdcs') ORDER BY `accounts`.`id` ASC LIMIT 1
---
  def attempt_login
    if params[:username].present? && params[:password].present?
      found_user = Account.where(:email => params[:username]).first